CSI API ETABS v1
cPropArea.GetTypeOAPI Method
 Retrieves the property type for the specified area property.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetTypeOAPI(
	string Name,
	ref int PropType
)
Function GetTypeOAPI (
	Name As String,
	ByRef PropType As Integer
) As Integer
Dim instance As cPropArea
Dim Name As String
Dim PropType As Integer
Dim returnValue As Integer
returnValue = instance.GetTypeOAPI(Name,
	PropType)
int GetTypeOAPI(
	String^ Name,
	int% PropType
)
abstract GetTypeOAPI :
        Name : string *
        PropType : int byref -> int
Parameters
Name
Type: System.String
The name of an existing area property.
PropType
Type: System.Int32
This is 1, 2 or 3, indicating the type of area property.
Value | Type
1 | Shell
2 | Plane
3 | Asolid
Return Value
Type: Int32
Returns zero if the type is successfully retrieved; otherwise it returns nonzero.
Remarks
Plane and Asolid area properties are not supported in ETABS.
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim PropType As Integer
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'get area property type
       ret = SapModel.PropArea.GetTypeOAPI("SLAB1", PropType)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cPropArea Interface
ETABSv1 Namespace